In [1]:
import pandas as pd

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Transformations

## Title basics

In [2]:
# Load title_basics and drop unnecessary columns
basics = pd.read_csv('Data/title_basics.csv.gz')
basics = basics[['tconst','primaryTitle','startYear','runtimeMinutes','genres']]
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,126,Drama

## title_genres

In [3]:
# extract ids and genres from title_basics
title_genres = basics[['tconst', 'genres']]
title_genres.head()

      tconst                  genres
0  tt0035423  Comedy,Fantasy,Romance
1  tt0062336                   Drama
2  tt0069049                   Drama
3  tt0088751    Comedy,Horror,Sci-Fi
4  tt0096056                   Drama

In [4]:
# convert string of genres to list of genres
title_genres['genres'] = title_genres['genres'].str.split(',')
title_genres.head()

C:\Users\caell\AppData\Local\Temp\ipykernel_21648\1782358020.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  title_genres['genres'] = title_genres['genres'].str.split(',')

      tconst                      genres
0  tt0035423  [Comedy, Fantasy, Romance]
1  tt0062336                     [Drama]
2  tt0069049                     [Drama]
3  tt0088751    [Comedy, Horror, Sci-Fi]
4  tt0096056                     [Drama]

## genres

In [5]:
# extract list of unique genres
title_genres = title_genres.explode('genres')
genres = title_genres['genres'].unique()
genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Mystery', 'Musical', 'Action', 'Adventure', 'Crime', 'Thriller',
       'Music', 'Animation', 'Family', 'History', 'War', 'Biography',
       'Sport', 'Western', 'Adult', 'Short', 'Reality-TV', 'News',
       'Talk-Show', 'Game-Show'], dtype=object)

In [6]:
# create mapping of genres to numeric genre ids
genre_map = dict(zip(sorted(genres), range(len(genres))))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [7]:
# apply map of genre integer ids to replace genre strings
title_genres['genres'] = title_genres['genres'].map(genre_map)

# create dataframe of genres and movies to add to sql db as joiner table
genres = pd.DataFrame()
genres['genre_id'] = genre_map.values()
genres['genre_name'] = genre_map.keys()
genres

    genre_id  genre_name
0          0      Action
1          1       Adult
2          2   Adventure
3          3   Animation
4          4   Biography
5          5      Comedy
6          6       Crime
7          7       Drama
8          8      Family
9          9     Fantasy
10        10   Game-Show
11        11     History
12        12      Horror
13        13       Music
14        14     Musical
15        15     Mystery
16        16        News
17        17  Reality-TV
18        18     Romance
19        19      Sci-Fi
20        20       Short
21        21       Sport
22        22   Talk-Show
23        23    Thriller
24        24         War
25        25     Western

# Load to SQL

In [8]:
connection_str = "mysql+pymysql://root:root@localhost/movies"
engine = create_engine(connection_str)

if not database_exists(connection_str):
    create_database(connection_str)
else:
    print('database exists')

database exists

## Basics

In [9]:
basics = basics.drop('genres', axis=1)

In [10]:
from sqlalchemy.types import *

key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

schema = {"tconst":String(key_len+1),
          "primaryTitle":Text(title_len+1),
         "startYear":Float(),
         "runtimeMinutes":Integer()}

In [11]:
basics.to_sql('title_basics', engine, dtype=schema, if_exists='replace', index=False)
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [20]:
pd.read_sql_query('select * from title_basics LIMIT 5', engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

## Ratings

In [13]:
ratings = pd.read_csv('Data/title_ratings.csv.gz')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66093 entries, 0 to 66092
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         66093 non-null  object
 1   averageRating  66093 non-null  float64
 2   numVotes       66093 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.5+ MB

      tconst  averageRating  numVotes
0  tt0035423            6.4     84746
1  tt0062336            6.4       161
2  tt0069049            6.7      7368
3  tt0088751            5.2       327
4  tt0096056            5.6       821

In [14]:
schema = {'tconst':String(key_len+1),
         'averageRating':Float(),
         'numVotes':Integer()}

ratings.to_sql('title_ratings', engine, dtype=schema, if_exists='replace', index=False)
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [21]:
pd.read_sql_query('select * from title_ratings LIMIT 5', engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     84746
1  tt0062336            6.4       161
2  tt0069049            6.7      7368
3  tt0088751            5.2       327
4  tt0096056            5.6       821

## title_genres

In [15]:
title_genres.to_sql('title_genres', engine, if_exists='replace', index=False)

149236

In [22]:
pd.read_sql_query('select * from title_genres LIMIT 5', engine)

      tconst  genres
0  tt0035423       5
1  tt0035423       9
2  tt0035423      18
3  tt0062336       7
4  tt0069049       7

## genres

In [16]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_id    26 non-null     int64
 1   genre_name  26 non-null     object
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [17]:
genres.to_sql('genres', engine, if_exists='replace', index=False)
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [23]:
pd.read_sql_query('select * from genres LIMIT 5', engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

## TMDB

In [18]:
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb = tmdb[['imdb_id','revenue', 'budget', 'certification']]
tmdb.info()
tmdb.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2498 entries, 0 to 2497
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2498 non-null   object
 1   revenue        2498 non-null   int64
 2   budget         2498 non-null   int64
 3   certification  796 non-null    object
dtypes: int64(2), object(2)
memory usage: 78.2+ KB

     imdb_id   revenue    budget certification
0  tt0113026         0  10000000           NaN
1  tt0113092         0         0           NaN
2  tt0116391         0         0           NaN
3  tt0118694  12854953    150000            PG
4  tt0118852         0         0             R

In [19]:
cert_len = tmdb['certification'].dropna().map(len).max()

schema = {'imdb_id': String(key_len+1),
         'revenue': Integer(),
         'budget': Integer(),
         'certification': Text(cert_len+1)}

tmdb.to_sql('tmdb_data', engine, dtype=schema, if_exists='replace', index=False)
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [24]:
pd.read_sql_query('select * from tmdb_data LIMIT 5', engine)

     imdb_id   revenue    budget certification
0  tt0035423  76019048  48000000         PG-13
1  tt0113026         0  10000000          None
2  tt0113092         0         0          None
3  tt0114447         0         0          None
4  tt0116391         0         0          None

In [25]:
pd.read_sql_query('SHOW TABLES', engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data